IDENTIFICATION DIVISION.
PROGRAM-ID. FactorialExample.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 Num PIC 9(3) VALUE 5.
01 Result PIC 9(9) VALUE 1.

PROCEDURE DIVISION.
    CALL 'FACTORIAL'.
    DISPLAY "Factorial of 5 is " Result.
    STOP RUN.

    ENTRY 'FACTORIAL'.
    IF Num <= 1 THEN
        EXIT PROGRAM
    ELSE
        MULTIPLY Num BY Result
        SUBTRACT 1 FROM Num
        CALL 'FACTORIAL'
    END-IF.
